[
  {
    "name": "Adrienne Wallace",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Adrienne-Wallace.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Cllr Adrienne Wallace is a graduate from Carlow College. She is a well-known activist and has been sitting on Carlow Council since 2019 where she has remained a thorn in the side of the establishment. This is her third general election having more than doubled her vote in 2020.\n'Through grassroots activism, I’ve fought for a women’s refuge in Carlow. I also founded the Repeal the 8th groups in Carlow and Kilkenny. As a family carer, I’ve&nbsp; been raising the serious issues with regards to the lack of local supports and school places for children with special needs. I also spearheaded initiatives to address vacancy and dereliction and pushed Carlow Council to support the BDS movement in solidarity with Palestine.'",
    "contact": {
      "email": "",
      "phone": "",
      "x.com": "https://x.com/AdriennePBPA?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/WallacePBP/",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/wallacepbp/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@awallacepbp?ref=pbp.ie"
    }
  },
  {
    "name": "Emma Hendrick",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Emma-Hendrick.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Emma was previously a Councillor for People Before Profit on South Dublin County Council. She used this position to build local campaigns and improve the lives of ordinary people.<br>Emma fought to bring extra council land into public use. She pushed the council to turn around void properties and supported local homeless people with their housing needs. Emma also fought to make housing allocation policy fairer for people on the long term housing list.<br>In addition, Emma mobilised local communities to improve their services. She led a campaign to secure a health facility and successfully stopped buses being removed from a local area. Emma also convened the Repeal the 8th campaign in Dublin Southwest during 2018.<br>As the mother of two young children, Emma drafted motions to support women in the workplace. She fought for free period products, breastfeeding friendly spaces, and maternity leave to support women entering local politics.<br>Emma has a master’s degree in public advocacy and activism from the National University of Ireland, Galway.",
    "contact": {
      "email": "",
      "phone": null
    }
  },
  {
    "name": "Caitríona Ní Chatháin",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Caitriona-NC-nomination-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Caitríona is from Clare and is a teacher, activist and an organiser. She is active in her trade union and stood as a socialist - feminist candidate in the recent Limerick mayoral elections. A key issue for Caitríona in this general election is the provision of public affordable housing and a break with housing as a commodity. She has campaigned on healthcare, LGBTQ rights, reproductive rights, gender violence, anti-racism and Palestinian solidarity. Caitríona stands for an end to US troops and US military using Shannon and no to facilitating exports for genocide in Gaza in our airspace. At a time of growing inequality, a vote for Caitríona would be a vote for a political programme that puts the wellbeing of people and the planet before corporate profits.",
    "contact": {
      "email": "",
      "phone": null
    }
  },
  {
    "name": "Asch Ní Fhinn",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Asch-Ni--Flynn.png",
    "candidatePage": null,
    "titles": [],
    "statement": "",
    "contact": {
      "email": null,
      "phone": null,
      "www.instagram.com": "https://www.instagram.com/aschnifhinnpbp/profilecard/?igsh=bmRta3duazlmcHRt&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@asch.ni.fhinn.pbp?_t=8rIqYo7eDMf&_r=1&ref=pbp.ie"
    }
  },
  {
    "name": "Mick Barry",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Mick-B-nomination-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Mick Barry has been an activist in Cork for over 30 years and a TD for Cork North Central since 2016. Mick has been a leader of the people power campaign which defeated water charges; fought for real action on the housing crisis and brought a bill before the Dail to ban economic evictions. Mick has helped countless workers get organised and stood with the Debenhams workers during their 406 day strike and stood with library workers, the LGBTQ+ community and migrants against far right intimidation. Mick has also been an outspoken voice for Palestinian freedom and against the genocide in Gaza and is campaigning to demand justice for disabled people, people with autism and for carers, who are the victims of state neglect. Mick is a member of the Socialist Party and believes that exploitation and inequality in all their forms can only be tackled on the basis of genuine socialist change where finally people and planet comes before profit and corruption.&nbsp;",
    "contact": {
      "email": "",
      "phone": null,
      "x.com": "https://x.com/MickBarryTD?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/MickBarryTD",
      "www.youtube.com": "https://www.youtube.com/shorts/yQi5jByAXRQ?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/mick_barrytd/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@mick.barrytd?ref=pbp.ie"
    }
  },
  {
    "name": "Joe Moore",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Joe-Moore.png",
    "candidatePage": null,
    "titles": [],
    "statement": "I have a long record of fighting for worker’ rights and against all forms of oppression. I have been an active member of the Communications Workers Union for over 40 years. During that time, I held the position of Branch Secretary in the Cork District Branch for 14 years, I served as a member of the National Executive for 6 years. Locally I represented my union on the Cork Council of Trade Unions for 30 years, I served as President of the Council from 2000 to 2002.\nI play an active role in opposing state racism. I was a founder and active member of Traveller and Settled Solidarity and Anti Deportation Ireland.",
    "contact": {
      "email": null,
      "phone": null
    }
  },
  {
    "name": "Zoe Laplaud",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Zoe-Laplaud.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Zoe&nbsp;is a socialist, a trans activist, and a Gaeilgeoir. She was born and raised in West Cork and has been a political activist for a number of years and has campaigned on housing, environmental issues, LGBT rights, and workers’ rights during this time. Her first exposure to the importance of people-power was through the Fridays for Future climate movement and since then she has been active in a wide range of campaigns to build a better Ireland. She was active in the student movement, has consistently campaigned in support of Palestine, and has been a committed anti-fascist voice. Rural Ireland has been seriously neglected by successive governments and&nbsp;Zoe&nbsp;is running to offer a real alternative and serious solutions to working people across West Cork.",
    "contact": {
      "email": "",
      "phone": null,
      "www.facebook.com": "https://www.facebook.com/61567467776654",
      "www.instagram.com": "https://www.instagram.com/zoelaplaudpbp/?ref=pbp.ie"
    }
  },
  {
    "name": "Shane Laird",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Shane-Laird.png",
    "candidatePage": null,
    "titles": [],
    "statement": "My name is Shane Laird.I have lived here in Cork City for 16 years. I got involved with politics at a young age when my parents took me to protests against the Iraq war. I saw the power of mass movements. I was involved in the referendum for gay marriage.\nI have been active in opposing the government's effort to undermine Irish neutrality. I have campaigned to protect workers rights, fight the rising cost of living and protect public spaces. When the far right held a number of rallies outside of the Cork library, I joined the wider community in Cork countered them.",
    "contact": {
      "email": null,
      "phone": null,
      "x.com": "https://x.com/PBPCork?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/shanelairdpbp",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/shanelairdpbp/?hl=en&ref=pbp.ie"
    }
  },
  {
    "name": "Carol Gallagher",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Carol-Gallagher.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Carol was born and raised in Strabane where she has worked in various teaching and educational roles for 30 years, latterly on short-term, precarious contracts.\nShe experiences first-hand, and campaigns against, the inequalities faced by many in the Sperrin DEA, including the rising costs of living, challenges facing private renters and cuts to public services.\nA strong advocate for workers rights, she stands in solidarity with striking workers and is an active supporter on picket lines.",
    "contact": {
      "email": null,
      "phone": null
    }
  },
  {
    "name": "Bernard Mulvany",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Bernard-Mulvaney.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Bernard is a full time carer and has been actively involved in the disability and caring movement for 10 years.\nHe has been very involved in fighting for the rights of workers, most notably the Debenhams workers, and last summer he spent the entire summer on the picket line supporting Iceland workers for their entitlements.\nHe co-founded the disability rights campaign Access 4 All and won a huge victory in the inclusion of upgrading of all the lifts to train stations across Ireland in the program for government.",
    "contact": {
      "email": null,
      "phone": null,
      "x.com": "https://x.com/mulvanypeopleb1?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/BernardMulvanyPBP",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial/featured?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/bernardpbp7/?ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@bernardmulvanypbp?ref=pbp.ie"
    }
  },
  {
    "name": "Brigid Purcell",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/HEADSHOTS-FOR-ELECTION-POSTERS-Recovered.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Brigid Purcell is a young community activist and worker from Ringsend. In 2021 she ran in the Dublin Bay South by-election to fight for renters, workers rights, decent public services and the environment, and came 4th in first preferences during the local elections.\nShe has played a role in a number of local campaigns - from the Cost of Living Coalition to the liberation of Palestine to anti-racism work to protecting Dublin Bay against pollution.\n20 years of austerity and 100 years of Fianna Fáil and Fine Gael has done serious damage to communities in Dublin Bay South. The working class of Dublin Bay South is consistently left behind and needs a principled socialist voice in the Dáil to fight for it. Brigid can be that voice.",
    "contact": {
      "email": null,
      "phone": null,
      "x.com": "https://x.com/BrigidPurcell?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/BrigidPurcellPBP",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial/featured?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/brigidpurcell_pbp/?ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@brigidpurcell_pbp?ref=pbp.ie"
    }
  },
  {
    "name": "Eoghan Ó Ceannabháin",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/EOGHAN---CEANNABH-IN.png",
    "candidatePage": null,
    "titles": [],
    "statement": "I am an eco-socialist, a community activist and a musician. I have been a campaigner on housing, workers' rights, Palestine solidarity, climate action and anti-racism for almost a decade.\nI am a renter and a member of the Community Action Tenants' Union. I have stood with the union in opposing evictions and have campaigned with Take Back the City, Raise the Roof and the National Homeless and Housing Coalition.\nAs a musician, I am very concerned with the loss of cultural space in our city. Along with other musicians, I led the campaign to save the Cobblestone pub from being destroyed and replaced with a 9-storey hotel. This kind of campaign provides us with a glimpse of what kind of city and society we can win if can get organised.\nI have been a member of United Against Racism since 2015 and have campaigned against direct provision and for the rights of asylum seekers in that time. Recent efforts by the Government to scapegoat asylum seekers are a transparent attempt to divert people's attention away from their own abject failures on housing, healthcare and the cost of living.\nThere is enough money in the country to transform our society for the benefit of the many, instead of the wealthy few. To do that, we need to put an end to more than a century of Fianna Fáil and Fine Gael rule and bring about a Left Government. I guarantee that if elected, I will not prop these parties up in coalition.\nLike all People Before Profit TDs, I will only take the average industrial wage if elected. Public representatives should not earn significantly more than the people they represent.",
    "contact": {
      "email": "",
      "phone": null,
      "x.com": "https://x.com/EoghanOCPBP?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/EOCeannabhainPBP",
      "www.youtube.com": "https://www.youtube.com/watch?v=C92RdbVwnIY&ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/eoghanoceannabhain/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@ceannabhain?lang=en&ref=pbp.ie"
    }
  },
  {
    "name": "Gino Kenny",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Gino-Kenny--1-.png",
    "candidatePage": null,
    "titles": [],
    "statement": "I have been an elected representative in this community for the past 15 years. I served as a Councillor for seven years, in 2016 I was elected to the Dáil on the back of my involvement in the local water charges campaign among other community campaigns. I was subsequently re-elected in 2020.\nIn my time as a TD I have championed many causes, most notably around medical cannabis, disability rights, women’s health issues, housing, drug reform and bringing forward legislation around voluntary assisted dying. I am currently the People Before Profit Spokesperson for Health and a member of the Oireachtas Health Committee. Most recently I was appointed as chair of the Special Dáil Committee on Drug Use.",
    "contact": {
      "email": "",
      "phone": null,
      "x.com": "https://x.com/Ginosocialist?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/CllrGinoKenny",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/ginotdkenny/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@ginotdkenny%20%20target=?ref=pbp.ie"
    }
  },
  {
    "name": "Conor Reddy",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Conor-Reddy--1--1.png",
    "candidatePage": null,
    "titles": [],
    "statement": "I’m a community and housing activist from Ballygall. Since 2020 I’ve been a PhD researcher in Immunology at Trinity College Dublin, working to understand how stress and trauma negatively impacts the health of homeless people.\n\nI have been a key activist in the housing, environmental and Palestine Solidarity movements - playing a leading role in Take Back the City, Raise the Roof and the National Homeless and Housing Coalition.\nI’ve supported workers from Debenhams, ESB and across the Trade Union movement. I helped to found the PWO, a union for PhD researchers and served as its President from 2022-23.\nI’m a renter, part of the locked-out generation and now I’m running in the General Election to break the 102 year cycle of Fianna Fáil and Fine Gael rule to build a better, fairer Ireland for All. If elected, I will take only the average industrial wage - we need representatives who truly understand the struggles of ordinary working people.\n",
    "contact": {
      "email": "",
      "phone": "",
      "x.com": "https://x.com/ConorReddy95?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/ConorReddyPBP",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/conor.reddypbp/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@conorreddypbp?ref=pbp.ie"
    }
  },
  {
    "name": "Síomha Ní Aonghusa",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Siomha-Ni--Aonghusa.png",
    "candidatePage": null,
    "titles": [],
    "statement": "",
    "contact": {
      "email": "",
      "phone": null,
      "x.com": "https://x.com/PBPRathdown?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/profile.php?id=100068372762810",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial/featured?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/siomha_peoplebeforeprofit/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@peoplebeforeprofit?ref=pbp.ie"
    }
  },
  {
    "name": "Hazel De Nortúin",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Hazel-De-Nort-un.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Since becoming a Councillor, I’ve successfully fought for a dedicated D10 Domestic Violence Liaison worker and funding for research on local domestic violence services. I worked to establish an Irish language playschool and cafe with the aim to support the fight for a Gaelscoil in D10/12. I was a founding member of BARN – the Ballyfermot Anti-Racist Network.",
    "contact": {
      "email": "",
      "phone": "",
      "x.com": "https://x.com/HazelPBP?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/hazeldenortuin",
      "www.youtube.com": "https://www.youtube.com/watch?v=NqbfOu-6cBo&ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/hazelnxx/?ref=pbp.ie"
    }
  },
  {
    "name": "Paul Murphy",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Paul-Murphy.png",
    "candidatePage": null,
    "titles": [],
    "statement": "I was first elected in October 2014 on my firm opposition to the water charges and commitment to build a people-power movement to defeat them. I have used my position to make a dfference for working people since.&nbsp;\nIn the last Dáil term, I strongly opposed the government’s attempt to roll back Irish neutrality and join NATO. I exposed the corruption of four ministers and won a High Court case against SIPO to force them to investigate Leo Varadkar for leaking a contract.&nbsp;\nI introduced Bills for\n(You can see more of my work <a href=\"https://bit.ly/PMurphy-Dail?ref=pbp.ie\">here</a>.)\nI am a longtime campaigner for Palestinian liberation and was imprisoned in Israel in 2011 for taking part in the Freedom Flotilla which sought to break the blockade of Gaza.&nbsp;",
    "contact": {
      "email": "",
      "phone": "",
      "x.com": "https://x.com/paulmurphy_TD?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/paulmurphytd",
      "www.youtube.com": "https://www.youtube.com/@PaulMurphy_TD?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/paulmurphy_td/?ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@paulmurphy_td?ref=pbp.ie"
    }
  },
  {
    "name": "Ruth Coppinger",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Ruth-C-nomination-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Ruth Coppinger is a teacher, and a Socialist Party activist in Dublin West for more than 30 years - as a councillor and a TD. Ruth has organised against racism and racist attacks; solidarity with survivors of institutional abuse; solidarity actions for Gaza; listened to people concerned and publicly changed her position on the care referendum, calling for a no vote as part of a campaign to demand justice for carers and disabled activists and is working with many parents of autistic children to fight the neglect they have suffered. Ruth has organised many solidarity protests against gender based violence and demanding substantial changes in legal and court procedures to protect victims; stood on the picket line with the Debenham workers every day of their strike and assisted other workers in the community sector, and migrant health workers to get organised. Ruth was crucial to the achievement of abortion rights and was also a national leader in the successful anti household tax and water charges movement.&nbsp;<br>",
    "contact": {
      "email": "",
      "phone": null
    }
  },
  {
    "name": "Richard Boyd Barrett",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Richard-Boyd-Barrett.png",
    "candidatePage": null,
    "titles": [],
    "statement": "",
    "contact": {
      "email": "",
      "phone": "",
      "www.twitter.com": "https://www.twitter.com/RBoydBarrett?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/richard.b.barrett.7",
      "www.youtube.com": "https://www.youtube.com/@RichardBoydBarrettTDOfficial/featured?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/richardboydbarrett/?ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@richardboydbarrett?ref=pbp.ie"
    }
  },
  {
    "name": "Ollie Power",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Ollie-Power.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Ollie Power is a socialist who fights for ordinary people, never for landlords, the wealthy, or their representatives in government. He is a housing activist and anti-eviction campaigner.\nHe is involved in Palestine solidarity activism in Fingal. He is driving a “Make them Pay” campaign to force religious orders to pay redress to survivors of church abuses. He is trade unionist and teacher in a DEIS school.",
    "contact": {
      "email": null,
      "phone": null
    }
  },
  {
    "name": "Bryn Edwards",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Byrn-Edwards.png",
    "candidatePage": null,
    "titles": [],
    "statement": "My name is Bryn Edwards, and I am the People Before Profit representative for Dublin Fingal West, standing in the general elections in November 2024. As a campaigner and activist I have stood with those facing eviction, and I aim to use my platform to fight for more public housing and local services across Fingal West.",
    "contact": {
      "email": null,
      "phone": null,
      "www.facebook.com": "https://www.facebook.com/brynedwardspbp",
      "www.instagram.com": "https://www.instagram.com/brynedwardsy/?ref=pbp.ie"
    }
  },
  {
    "name": "Conor Burke",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Conor-B-nomination-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Conor Burke is an artist, gallery technician, and carpenter from Galway and an activist with the Socialist Party and Peopel Before Profit - Solidarity for many years in many community campaigns, including defeating the water charges, repealing the eighth amendment. Conor has stood on picket lines, including nurses, retail workers, and public transport workers. Conor strongly opposes the genocide being carried out by Isreal in Gaza and if elected will strive to use his platform to fight this at every level. Conor believes the ‘’for profit’’ capitalist housing model being put forward by the main government and opposition parties will not address the key causes of this problem. We need a state house building programme to cut across the profit of private property, developers, landlords, and vulture funds and provide affordable homes for all to buy or rent.&nbsp;",
    "contact": {
      "email": "",
      "phone": null
    }
  },
  {
    "name": "Maisie Mc Master",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Maisie-McMaster.png",
    "candidatePage": null,
    "titles": [],
    "statement": "",
    "contact": {
      "email": null,
      "phone": null,
      "www.facebook.com": "https://www.facebook.com/PeopleBeforeProfitGalway",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial/videos?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/maisiemcmasterpbp/?hl=en&ref=pbp.ie"
    }
  },
  {
    "name": "Cian Prendiville",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Cian-Prendiville.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Cian Prendiville is a former councillor in Limerick City, where he led to anti-water charges movement and came within 300 votes of winning a seat in the 2016 General Election. In recent years he has been an activist and organiser with Raise the Roof, Ireland-Palestine Solidarity Campaign and People Before Profit.",
    "contact": {
      "email": null,
      "phone": null,
      "x.com": "https://x.com/cianplk?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/@cianp/",
      "www.youtube.com": "https://www.youtube.com/@PeopleBeforeProfitOfficial?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/cianplk/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@cianplk?lang=en&ref=pbp.ie"
    }
  },
  {
    "name": "Leah Whelan",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Leah-W-candidate-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Leah first got involved in activism in the Repeal the 8th campaign and has been part of organising many protests related to International Women’s Day, gender based violence and for proper funding of refuge services. Leah works in education and is an activist with the Socialist Party, and ROSA - socialist feminist movement and stands for the complete separation of church and state. Priorities for Leah include combating the conditions that are driving young people to emigrate. Leah believes the state must intervene to provide affordable homes to buy and rent, and stands for a trade union movement that fights for decent wages and conditions and will champion the cause of young workers who suffer particular discrimination and oppression. Inspired by the ‘’people power’’ movement that is mobilising in solidarity with Palestine, Leah demands that the US military, who are aiding and abetting a genocide, be immediately excluded from Shannon and from Irish airspace.&nbsp;",
    "contact": {
      "email": "",
      "phone": null
    }
  },
  {
    "name": "Robert Cosgrave",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Rob-C-nomination-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Robert is active with the Socialist Party and has been active in the victories for abortion rights and against the water charges, as well as the movement in solidarity with Palestine. These struggles showed what can be won by ordinary working class people coming together to fight. This election takes place in the context of a housing crisis; deteriorating public services; and wages that come nowhere near standing up to years of a cost-of-living crisis. Internationally and in Ireland far-right groups have sought to use these crises facing ordinary people to whip up a racist frenzy and shift the blame away from the profiteers who have created these problems with the support of the political establishment. Robert wants to see a committed socialist fraction in the Dáil that uses its position to build people power movements to fight on the key issues and for a society where human need and solidarity come before private profit.&nbsp;",
    "contact": {
      "email": "",
      "phone": null
    }
  },
  {
    "name": "Ken Mooney",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Ken-Mooney.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Ken Mooney is a graduate from University of Limerick.\nHe joined People Before Profit in 2021 and is running to fight for affordable and secure housing.\n“When I started in college, living down in Limerick in a house, that to be quite honest, you wouldn’t put a dog in. It was a devastating situation,&nbsp; and I was paying premium prices – €600 per month – and I saw how there was just a complete lack of housing. We’ve had this housing crisis since I was a child, and I realised the Government can do something about but they aren’t doing anything about it.\nHe has been involved in campaigns for causes including Palestine, Yemen, housing, minimum wage increases, and carer supports.",
    "contact": {
      "email": null,
      "phone": null
    }
  },
  {
    "name": "Ruairí Fahy",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/DSC06535_01-Photoroom.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Ruairí is a housing and environmental activist who has successfully defended families against illegal evictions, organised workers in trade unions and tackled corporations trying to dump polluting industries across the mid-west which threaten both our health and a livable future for our children.",
    "contact": {
      "email": "",
      "phone": "",
      "www.twitter.com": "https://www.twitter.com/ruairifahypbp?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/ruairifahypbplk",
      "www.instagram.com": "https://www.instagram.com/ruairifahypbp/?ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@ruairifahypbp?ref=pbp.ie"
    }
  },
  {
    "name": "Laura Fahy",
    "imageURL": "https://www.pbp.ie/undefined",
    "candidatePage": null,
    "titles": [],
    "statement": "",
    "contact": {
      "email": null,
      "phone": null
    }
  },
  {
    "name": "Dave Smyth",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Dave-Smyth.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Dave Smyth is an electronic engineer. He’s married to Barbara and they have 3 adult children aged 27, 23 and 19. He is acutely aware of the real struggles facing young people as a direct result of FF &amp; FG policies. Rents are out of control and buying a home is an impossibility for most.",
    "contact": {
      "email": null,
      "phone": null,
      "www.facebook.com": "https://www.facebook.com/PBPLDWH",
      "www.instagram.com": "https://www.instagram.com/longford.socialist/?hl=en&ref=pbp.ie"
    }
  },
  {
    "name": "James Renaghan",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/James-Reneghan.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Dundalk is a town I’m proud to call my home. I’m a former Dundalk FC youth player, my dad is a local security worker and all my life I’ve seen a Dundalk that’s less than what it could be. This rundown of our communities is the result of the failed policies of Fianna Fáil, Fine Gael and their mudguards in Labour and the Green Party. They rule solely in the interests of big corporations, not ordinary people.\nI think another Dundalk is possible, one where we tackle the horrors of homelessness, lack of healthcare and poverty through radical policies that put people before corporate profits.",
    "contact": {
      "email": null,
      "phone": null,
      "www.instagram.com": "https://www.instagram.com/jamesrenaghan/?hl=en&ref=pbp.ie"
    }
  },
  {
    "name": "Joe Daly",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Joe-Daly.png",
    "candidatePage": null,
    "titles": [],
    "statement": "I am a native of Castlebar, a father of four children and a secondary teacher in St. Gerald’s College Castlebar for 17 years. I’ve been a leading activist on many campaigns from Water Charges, Repeal of the 8th, Pensions, Climate Action, Palestine, Anti-Fascism, Housing &amp; Health.",
    "contact": {
      "email": null,
      "phone": null,
      "www.facebook.com": "https://www.facebook.com/PBPMayo",
      "www.youtube.com": "https://www.youtube.com/@RichardBoydBarrettTDOfficial/featured?ref=pbp.ie",
      "www.instagram.com": "https://www.instagram.com/joedalypbpmayo/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@joedalypbpmayo?lang=en&ref=pbp.ie"
    }
  },
  {
    "name": "Clara McCormack",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Clara-McCormack.png",
    "candidatePage": null,
    "titles": [],
    "statement": "",
    "contact": {
      "email": null,
      "phone": null
    }
  },
  {
    "name": "Finbar Lynch",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Finbar-Lynch.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Finbar took a leading role in organising the <em>Meath Says No To Hate</em> protest last year after a local secondary school student was the victim of a hate crime. He has been an active member of Fórsa Trade union, the Community Action Tenants Union and United Against Racism.",
    "contact": {
      "email": null,
      "phone": null,
      "www.instagram.com": "https://www.instagram.com/deadflegblues/?hl=en&ref=pbp.ie"
    }
  },
  {
    "name": "Keishia Taylor",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Keishia-T-nomination-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Keishia is an activist with the Socialist Party and ROSA Socialist Feminist Movement and works in education. Keishia became politically active in 2016, joining ROSA to fight for abortion rights and bodily autonomy for all. Winning a pro-choice Repeal made me utterly convinced that through collective action and organising, workers and young people can shape our society in all of our interests, and not those of the big business or billionaires. Since then, Keishia has been involved in campaigning against the genocide in Palestine, racism, violence against women, and the climate catastrophe. Keishia has been to the fore in the fight for LGBTQ+ rights and trans healthcare, disability rights, healthcare, education and childcare provision. Keishia is active in her union and fighting for workers rights and pledges to fight for the billions in surplus and Apple Tax money to be invested to provide affordable homes for all and fixing public services.",
    "contact": {
      "email": "",
      "phone": null
    }
  },
  {
    "name": "Andrew Mannion",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Andrew-Mannion.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Through my own personal experience organising workers into a union and going out on strike for union recognition, it's clear that workers cannot wait for their employers or the government to do right by them. We need to organise and fight for the change we want to see!\nI was born and raised in Ballinasloe, I've worked in the town for most of my adult life and now work as a support worker with the Brothers of Charity in Ballinasloe.\nCurrently, I live in rented accommodation in Athlone due to the poor availability of adequate housing in the town.",
    "contact": {
      "email": null,
      "phone": null,
      "x.com": "https://x.com/AMannionPBP?ref=pbp.ie",
      "www.facebook.com": "https://www.facebook.com/profile.php?id=61551429900735",
      "www.instagram.com": "https://www.instagram.com/amannionpbp/?hl=en&ref=pbp.ie",
      "www.tiktok.com": "https://www.tiktok.com/@amannionpbp?ref=pbp.ie"
    }
  },
  {
    "name": "Gino O'Boyle",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/IMG_4016.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Gino O’Boyle is a Community Activist from Forthill in Sligo. He was co-opted onto Sligo County Council in 2015 after the passing of his father Seamie and was re-elected in 2019 and 2024. Gino he has spent the last decade fighting for a fairer Sligo. He has consistently opposed property taxes and rent increases while fighting for local services and public amenities. He has also played an active role in Right2Water, and the Cost of Living Campaign and is currently a member of the Sligo Palestine Solidarity Campaign. Gino has also been a local voice for the victims of Mother and Baby Homes. He says:",
    "contact": {
      "email": null,
      "phone": null
    }
  },
  {
    "name": "Diana O'Dwyer",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Diana.png",
    "candidatePage": null,
    "titles": [],
    "statement": "Diana O’Dwyer has been a socialist activist for nearly 20 years. She has campaigned against water charges and for repeal, housing action and to stop the genocide in Gaza. She currently works as a researcher for People Before Profit.&nbsp;\nFianna Fáil and Fine Gael have run this country for 100 years. They have made corporate landlords, vulture funds and big business very rich while creating a housing disaster and running health, education, childcare and disability services into the ground.&nbsp;&nbsp;",
    "contact": {
      "email": null,
      "phone": null,
      "twitter.com": "https://twitter.com/dianaodwyer?ref=pbp.ie"
    }
  },
  {
    "name": "Patrick Curtin",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Patrick-Curtin.png",
    "candidatePage": null,
    "titles": [],
    "statement": "I’ve lived in Waterford since 2016 to study at W.I.T. Over the years, I’ve worked in different sectors and volunteered with local groups. I’ve been politically active on key issues like housing, education, and mental health, which remains a serious concern due to the lack of services in Waterford.",
    "contact": {
      "email": null,
      "phone": null,
      "www.facebook.com": "https://www.facebook.com/profile.php?id=61554360839875",
      "www.instagram.com": "https://www.instagram.com/pcurtin_pbp/?hl=en&ref=pbp.ie"
    }
  },
  {
    "name": "Martina Stafford",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Martina-S-nomination-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Martina is from Wexford and has been an activist and organiser for years on issues such as the cost of living, housing and gender- based violence. She is a musician and has worked as a carer for people with intellectual and physical disabilities. A key issue for Martina in this general election is the crisis in care for children with autism and people with disabilities. She has campaigned on LGBTQ rights, reproductive rights, anti-racism and Palestinian solidarity. Martina stands for an end to US troops and US military using Shannon and no to facilitating exports for genocide in Gaza in our airspace. At a time of growing inequality, a vote for&nbsp; Martina would be a vote for an alternative which puts the wellbeing of people and the planet before corporate profits.",
    "contact": {
      "email": "",
      "phone": null
    }
  },
  {
    "name": "Kellie McConnell",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Kellie-McConnell.png",
    "candidatePage": null,
    "titles": [],
    "statement": "As a dentist for 13 years and an activist at heart, I work every day for reproductive rights, climate justice, animal rights, housing, and healthcare for all. This year, I have focused on community organising with <em>North Wicklow Against Genocide</em>, against racism and getting Fine Gael and Fianna Fáil out, so we can tackle the catastrophes that they have caused. I ask for your number 1 vote to work with you towards a better, healthier, and fairer Wicklow.",
    "contact": {
      "email": "",
      "phone": null,
      "www.instagram.com": "https://www.instagram.com/kelliemcconnellpbp/?hl=en&ref=pbp.ie"
    }
  },
  {
    "name": "Aislinn O’Keeffe",
    "imageURL": "https://www.pbp.ie/content/images/size/w2000/2024/11/Aislinn-OK-nomination-pic.jpg",
    "candidatePage": null,
    "titles": [],
    "statement": "Aislinn O’ Keeffe has been involved in activism since 2017 on issues such as gender-based violence, abortion rights, LGBTQ+ rights, anti-racism and Palestine. A key issue for O’ Keeffe in this general election is the provision of public affordable housing &amp; to bring an end to the current system of housing-as-commodity. Aislinn also prioritises the provision of healthcare and disability services including ensuring that every child receives a school place and has access to the services they need. Real action on stopping the genocide in Palestine is a core concern and if elected she will endeavour to make this an urgent priority for the Dáil. Additionally, working as a tour guide with ten years' experience, O’ Keeffe has a keen sense of the importance of preserving our culture, heritage and environment.",
    "contact": {
      "email": "",
      "phone": null
    }
  }
]
