{"name":"Catherine Ardagh","imageURL":"https://www.fiannafail.ie/hubfs/GE24_Ballot%20Papers%20Photos34.jpg","candidatePage":"https://www.fiannafail.ie/general-election/catherine-ardagh?hsLang=en","party":"Fianna Fáil","titles":"[\"Senator in Dublin South Central. Spokesperson on Social Protection.\", \"General Election Candidate for Dublin South Central.\"]","statement":"Senator Catherine Ardagh was re-elected to the 26th Seanad on the Industrial and Commercial Panel and is the current Fianna Fail Seanad Spokesperson on Social Protection. Catherine also sits on the joint committee on Foreign Affairs and Defence.\nCatherine was born and raised in Dublin South Central and practices as a solicitor and notary public from her office in Crumlin Village. Locally, Catherine has been involved in various community groups in the area including The D12 Food Bank, The D12 Task force, The South Inner City Community Development Association, The Crumlin Business Association and The Walkinstown Business Association.\nPriorto her election to the Seanad in 2016, Catherine sat on Dublin City Council representing the Crumlin/Kimmage area. Catherine was also Fianna Fail Seanad leader in the 25th Seanad. Catherine currently chairs the cross-party committee on cancer services.","contact":{"email":"Catherine.ardagh@oireachtas.ie","phone":"01-6183907","x.com":"https://x.com/cardagh","www.instagram.com":"https://www.instagram.com/cardagh501/","www.facebook.com":"https://www.facebook.com/ardaghforaction","www.linkedin.com":"https://www.linkedin.com/in/catherineardagh"}}{"name":"Tom Brabazon","imageURL":"https://www.fiannafail.ie/hubfs/GE24_Ballot%20Papers%20Photos23.jpg","candidatePage":"https://www.fiannafail.ie/general-election/tom-brabazon?hsLang=en","party":"Fianna Fáil","titles":"[\"Dublin City Council.\", \"General Election Candidate for Dublin Bay North.\"]","statement":"I have represented my constituents as a City Councillor since 2003 and have given them 21 years of loyal service. I have successfully contested every election since and I most recently topped the poll in Donaghmede Local Electoral Area with over 20% of the first preference vote.\n \nI was humbled when I was elected as Lord Mayor of Dublin in 2020. I currently serve as the Chair of the Economic and Enterprise Strategic Policy Committee of Dublin City Council.\n \nI am a passionate advocate for our area here in Dublin Bay North. I have a track record of working extremely hard in the interest of my constituents. I have resided in this constituency almost all my life, and I was educated at Belgrove National School, Chanel College, Scoil Mhuire Marino, UCD, College of Commerce and later the Law Society of Ireland.\n \nI am qualified Solicitor, Trademark Attorney, Chartered Arbitrator, Notary Public and trained Mediator. I have my own practice, which was based in Fairview for many years, and in recent years I have moved to Raheny.\n \n I am a passionate Gaelgeoir. I am an avid sports fan, and in particular I am a die-hard Dublin GAA fan having played football for Parnells GAA Club in Coolock. A local voice at the national table, fighting for the best interests of Dublin Bay North.","contact":{"email":"tom.brabazon@dublincity.ie","phone":"086-8092944"}}{"name":"Shay Brennan","imageURL":"https://www.fiannafail.ie/hubfs/Shay%20Brennan-1.jpg","candidatePage":"https://www.fiannafail.ie/general-election/shay-brennan?hsLang=en","party":"Fianna Fáil","titles":"[\"Dunlaoghaire-Rathdown County Council.\", \"General Election Candidate for Dublin Rathdown.\"]","statement":"Shay is a dedicated member of Fianna Fáil, currently serving as a councillor on Dún Laoghaire-Rathdown County Council, having first been elected in 2014. Throughout his tenure, he has held key leadership roles, including Cathaoirleach, Leas Cathaoirleach, group leader, and Strategic Policy Committee chair. Shay has been a vocal advocate for active travel and transport initiatives, consistently working to improve sustainable mobility options and enhance the community’s infrastructure. Shay’s other priorities include the construction of affordable family homes, a higher and more equitable inheritance tax threshold as well as protection of our climate and environment.\n \nWith a strong academic background in finance, Shay holds a degree in economics and a master’s in financial services. This expertise has been applied both in Ireland and internationally, giving him a wealth of experience in financial matters. His skills and insight in economics have informed his work on the council, particularly in strategic planning and policy development.\n \nAs he looks to the future, Shay is committed to continuing his work in advancing local and national issues, promoting economic growth, and building a more sustainable community for all.","contact":{"email":"sbrennan@cllr.dlrcoco.ie","phone":"086-8290570"}}{"name":"James Browne","imageURL":"https://www.fiannafail.ie/hubfs/GE24_Ballot%20Papers%20Photos78.jpg","candidatePage":"https://www.fiannafail.ie/general-election/james-browne?hsLang=en","party":"Fianna Fáil","titles":"[\"Minister of State Department of Justice with responsibility for International Law, Law Reform and Youth Justice. TD for Wexford.\", \"General Election Candidate for Wexford.\"]","statement":"James Browne was appointed Minister of State Department of Justice with responsibility for International Law, Law Reform and Youth Justice. in September 2020. \nJames was elected to Dáil Éireann in the February 2016 general election as a representative of Wexford and re-elected in the 2020 general election.\nHe has served as the Fianna Fáil Spokesperson on Mental Health, leading initiatives to reform mental health services in Ireland, including the Mental Health (Amendment) Act 2018 and served on the Oireachtas Committee on the Future of Mental Healthcare.\nHe was born in Enniscorthy, Wexford, and is the oldest of a family of 4. He was educated locally at St. Mary’s CBS, Enniscorthy before attending Waterford IT, University College Cork and the King’s Inns. He was called to the Bar in 2006.","contact":{"email":"jamesbrownetd@oireachtas.ie","phone":"053 9235046","twitter.com":"https://twitter.com/JamesBrowneTD","www.instagram.com":"https://www.instagram.com/jamesbrownetd/","www.facebook.com":"https://www.facebook.com/JamesBrowneTD","www.linkedin.com":"https://www.linkedin.com/in/jamesforwexford/"}}{"name":"Mary Butler","imageURL":"https://www.fiannafail.ie/hubfs/GE24_Ballot%20Papers%20Photos77.jpg","candidatePage":"https://www.fiannafail.ie/general-election/mary-butler?hsLang=en","party":"Fianna Fáil","titles":"[\"Waterford.\", \"General Election Candidate for Waterford.\"]","statement":"Mary Butler was born and raised in Waterford. She is married to her husband Michael and has three children.\nMary is a lifelong community activist and member of the Fianna Fáil party. She has a strong grounding in the retail sector and successfully ran the family business, a grocery shop in Portlaw, for 17 years.\nIn 2014 she contested local elections in her local electoral area of Comeragh and won a seat. Mary then secured a nomination in 2016 to contest the General Election. She was elected to the Dáil on the first count, receiving 10,603 votes and topping the poll.\nFrom 2016 to July 2020, Butler was appointed Fianna Fail Spokesperson for Older People and Health Promotion, also chairing the All Party Oireachtas Group on Dementia.\nMary produced several pieces of legislation during this period in respect of older people and safeguarding.\nFollowing her re-election to the Dáil in the 2020 General Election, she was appointed to the Special Dáil Committee with responsibly for COVID-19 response. In July 2020, Butler had the honour of being appointed Minister of State for Mental Health and Older People. Upon receiving her Seal of Office, she spoke of her delight and honour at being the first female Waterford TD to have been appointed Minister.\nIn 2021 Mary was elected Vice President of Fianna Fáil. During her time as Minister, Mary is very proud to have introduced legislation to modernise the Nursing Homes Support Scheme (NHSS), commonly referred to as Fair Deal, a system of financial support for people who require long-term residential care. She has also maintained a dedicated focus on ensuring ringfenced funding for dementia supports and increased Ireland’s mental health budget by 30% since entering the post.\nShe remains committed to ensuring that the voice and choice of older people and those living with mental health difficulties in Ireland are heard.","contact":{"email":"mary.butler@oireachtas.ie","phone":"051 841437","twitter.com":"https://twitter.com/MaryButlerTD","www.instagram.com":"https://www.instagram.com/marybutlertd/","www.facebook.com":"https://www.facebook.com/MaryButlerTD/","www.linkedin.com":"https://www.linkedin.com/in/mary-butler-8954b9152/?originalSubdomain=ie"}}