[
  {
    "name": "Áine Gladney Knox",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/aine-gladney-knox/",
    "statement": "Áine Gladney-Knox has worked as a beauty therapist for many years across Carlow and Kilkenny. Married to John, they have 2 children and currently reside in Goresbridge.\nOriginally from Bagenalstown, Áine comes from a family steeped in public service. Aine’s father Andy is a long serving member of Carlow County Council. This family commitment to public service has given Áine has given Áine a deep understanding of the issues that effect people across the constituency.\nÁine has been involved with the Fleadh in Bagenalstown as well as in the Mount Leinster charity walks imitative. Áine is a strong advocate of carers and people with disabilities as well as adequate provision of mental health services.\nÁine has the drive and commitment to be a strong voice for Carlow in Dail Eireann."
  },
  {
    "name": "Natasha Newsome Drennan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/natasha-newsome-drennan/",
    "statement": "Natasha was raised in Knocktopher where she worked in the family business in the construction sector. Now living in Mullinavat with her husband John and their 4 boys running a suckler farm.\nNatasha is very aware of the struggles of farmers and rural communities. Natasha is committed to helping rural communities develop and get proper school and public transport and sporting and other facilities.\nNatasha works as an assistant in the Disability sector, and she is determined to help reduce waiting times for people on the list for assessments as well as increase funding for Disability services."
  },
  {
    "name": "Pauline Tully",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/pauline-tully/",
    "statement": "Pauline Tully has represented the Dail constituency of Cavan / Monaghan since February 2020. She is currently the Sinn Féin Spokesperson on Disability and Carers. She was vice chairperson of the Disability Matters Committee and a member of the Joint Committee for the Implementation of the Good Friday Agreement. She was also a member of the Autism Committee and of the subsequent All-Party Parliamentary Group on Autism. She also participated in the Cross-Party Interest Group for Carers and the Cross Party Oireachtas Group on Cancer.\nPauline is parent to two teenage sons Pearse and Eoghan and lives in rural Cavan near the villages of Ballinagh and Kilnaleck where she grew up on a small farm.\nShe is a former teacher in Breifne College in Cavan Town.\nShe served as a member of Cavan County Council from 1999 representing the Ballyjamesduff Electoral Area. Pauline retained the seat until 2012 when she resigned to meet the then care needs of her children.\nShe is passionate about her community and is a strong voice in the Dáil for the people of Cavan and Monaghan and the disabled people and carers nationwide."
  },
  {
    "name": "Matt Carthy",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/matt-carthy/",
    "statement": "Matt Carthy has been a voice for Monaghan people as a Councillor, MEP and a TD.\nWhile others are seen for the photo-ops and announcements, Matt stands with Monaghan workers, families and communities every step of the way. He has been among the most active opposition TDs in the Dáil, never afraid to raise the issues of concern to this constituency. If\nelected to government he will bring the same energy and work-ethic to ensuring that Monaghan finally gets its fair share of investment in jobs, housing and infrastructure."
  },
  {
    "name": "Cathy Bennett",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/cathy-bennett/",
    "statement": "Cathy Bennett has represented the people of North Monaghan as a Councillor for 12 years. She is currently the Cathaoirleach of Monaghan County Council, her second term in this role.\nCathy stands four-square with Monaghan workers, families and communities. In her role as Chairperson of Monaghan\nWomen’s Assembly, Cathy has championed women’s voices in public life. If elected to the Dáil she will ensure that Monaghan people finally get their fair share of investment in housing, in healthcare, in childcare and in the essential needs of all families."
  },
  {
    "name": "Donna McGettigan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/donna-mcgettigan/",
    "statement": "Born in Belfast, raised in Shannon, Donna lives with her son, and also has a stepdaughter. Donna, a lifelong activist, now 2-term Councillor, has a deep understanding of the challenges facing the people of County Clare. Her personal experiences with scoliosis and caring at home for her late husband, informs\nDonnas vision for a better future, one that prioritises the needs of families and enables our communities to thrive."
  },
  {
    "name": "Pat Buckley",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/pat-buckley/",
    "statement": "Pat Buckley is your local Sinn Féin TD. Born and raised in East Cork, where he continues to live with his wife and two children. His journey into politics was driven by a personal family tragedy through suicide, which led him to become a dedicated mental health rights activist. He has been a key figure in local community initiatives, including his role as PRO for the Let’s Get Together Foundation, a suicide prevention group credited with significantly reducing suicide rates in East Cork.\nPat has consistently focused on mental health, healthcare, and inequality in his time as your TD. He has published legislation and motions on mental health funding, patient rights and road safety. He has been a strong voice for improved mental health services. Recently backing local communities in the successful campaign to save Owenacurra mental health unity. As a member of the Oireachtas Committees on Health and Public Petitions, he contributed to the Sláintecare health reform plan and the Future of Mental Health Care report.\nPat has also been a consistent campaigner for better local water services, demanding a long term solution to boil water notices and new infrastructure to meet local needs.\nHe has also committed much of his time in the Dáil to promoting and fighting for better local flood defences and sustainable and responsible planning to better address the major challenges faced by flooding in the area of East Cork.\nPat remains committed to tackling local issues, from housing, workers rights and education to disability rights, working to build a fair and united Ireland that prioritizes ordinary people over the rich and powerful."
  },
  {
    "name": "Mehdi Özçınar",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/mehdi-ozcinar/",
    "statement": "A member of Sinn Féin for over a decade with an interest in politics and serving my community.\nI am a resident of the Cobh LEA. I currently work within a multinational company. I am also a local entrepreneur and small business owner.\nI will be a strong voice for local businesses, champion safer towns and communities, work for mental health and disability provision, push for affordable housing and enhance local infrastructure."
  },
  {
    "name": "Thomas Gould",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/thomas-gould/",
    "statement": "A proud Cork man, on his election in 2020 Thomas Gould became the first ever TD from Knocknaheeny.\nHe lives in Gurranabraher with his wife Michelle and their two daughters. He is a stalwart member of St Vincent’s Hurling and Football Club and the Northside Schools Coaching Initiative.\nPrior to his election as a TD, Thomas was a manager in logistics and served for 11 years on Cork City Council.\nAs the party’s spokesperson on Addiction and Recovery, Thomas believes in tackling poverty and resourcing recovery journeys. He is also a junior spokesperson on Housing and sits on the Oireachtas Housing Committee where he is passionate about social housing, vacancy, dereliction and people being locked out of home ownership.\nHe fights tirelessly to end the neglect of the Northside and deliver for local communities."
  },
  {
    "name": "Joe Lynch",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/joe-lynch/",
    "statement": "Joe is 34 years old and from Innishmore in Ballincollig. Educated locally at Gaelscoil Uí Ríordáin and Gaelcholáiste Choilm, he holds a Masters Degree in Government from UCC, as well as a Bachelors Degree in Accounting.\nA father of one, he is passionate about delivering affordable housing in Ballincollig and across Cork City. Joe has worked full-time in politics for over ten years, previously serving as senior political advisor in the Dáil to Mary Lou McDonald as head of the Sinn Féin Press Office.\nTá suim mhór agam sa Ghaeilge agus tá fáilte roimh chomhfhreagras trí Ghaeilge."
  },
  {
    "name": "Nicole Ryan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/nicole-ryan/",
    "statement": "Nicole Ryan, 31, is the Sinn Féin General Election candidate in Cork North West. With a Degree in Marine Engineering and a Diploma and Post-Grad in Addiction Studies, Nicole has spent the last 8 years running a successful drug education enterprise, educating over 13,000 post-primary students nationwide on the dangers of substance abuse.\nHaving grown up in Cork North West, Nicole is acutely aware of the issues facing this constituency, particularly those of our youth. Nicole is a passionate advocate of women’s health, access to affordable housing and mental well-being for all.\nAs a committed community and voluntary activist Nicole was awarded Humanitarian of the Year in 2018 and is a recipient of the Pride of Cork award in 2021, her dedication to improving our communities and hands-on experience make Nicole a strong advocate for positive change in Cork North West."
  },
  {
    "name": "Donnchadh Ó Laoghaire",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/donnchadh-o-laoghaire/",
    "statement": "Donnchadh Ó Laoghaire is the Sinn Féin TD for Cork South Central since 2016. He was previously a member of Cork County Council for the Carrigaline District of Cork County Council\nDonnchadh is the Sinn Féin spokesperson on Social Protection. He has also been spokesperson on Justice, Education and on Children. Tá an suim ag Donnchadh in oidhreacht agus cultúr na tíre, agus is Gaeilgeoir líofa é\nHe is ambitious for Cork, and believes that if Cork is to be the fastest growing City in Ireland, it needs major investment in Public Transport including a fit for purpose bus service and Light Rail, affordable housing for the people of Cork, as well as capital investment in Healthcare, Education.\nDonnchadh believes in Community as a force for good. He is a lifelong member of St Finbarrs National Hurling & Football Club, a member of the Board of Togher Community Association, and has also been a volunteer in many other ascepts of Community including Scouting and Family Support.\nDonnchadh (35) lives with his wife Eimear in Togher and their three children, Sé, Fiach & Nóinín"
  },
  {
    "name": "Michelle Cowhey Shahid",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/michelle-cowhey-shahid/",
    "statement": "I am a mother of three and a community activist in Donnybrook, Douglas. I believe in hard work, my experience includes running a successful takeaway business after my apprenticeship as a hairdresser. I’m involved with the Douglas Community Association Events team and the Douglas Camogie Club Committee. I advocate for community empowerment and, if elected, will be a strong voice for workers and families facing rising living costs and housing challenges"
  },
  {
    "name": "Clare O'Callaghan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/clare-ocallaghan/",
    "statement": "Clare is a teacher by profession.\nFamily is very important to Clare who believes that workers and families in West Cork deserve better services and facilities, particularly in rural and coastal communities.\nClare’s priorities include properly resourced school transport and facilities for young people, as well as better community healthcare including more GPs, out of hours doctors and resources for Bantry hospital.\nAs a parent and worker living in a rural community, Clare understands the challenges and has the real-life experience and passion to push for the change that is so badly needed."
  },
  {
    "name": "Donnchadh Ó Seaghdha",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/donnchadh-o-seaghdha/",
    "statement": null
  },
  {
    "name": "Pádraig Mac Lochlainn",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/padraig-mac-lochlainn/",
    "statement": "Pádraig Mac Lochlainn has proudly and passionately represented the people of Donegal for many years, locally and nationally. He lives in Buncrana with his wife Sinéad and he has two adult sons.\nPádraig is the Sinn Féin Chief Whip and Spokesperson on Fisheries and the Marine.\nPrior to being elected to the Dáil in February 2011, he had served for many years on Donegal County Council and Buncrana Town Council. He twice served as Mayor of Buncrana in 2005/2006 and 2010/2011 and has served once as Deputy Mayor of Donegal 2010/2011.\nHe was a community activist and campaigner, locally and nationally before entering elected politics."
  },
  {
    "name": "Pearse Doherty",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/pearse-doherty/",
    "statement": "Pearse lives in Goath Dobhair with his wife Róisín and four sons. He is Sinn Féin’s Deputy Dáil Leader, Finance Spokesperson and TD for Donegal since the 2010 by-election.\nPassionate and tireless, Pearse has been Donegal’s voice in the Dáil, consistently challenging the government on the many issues facing the county. He has also led the charge in taking on the insurance industry and tackling the cost-of-living crisis.\nPearse is a director and one of the founders of Sult music festival. The non-profit community festival located in the Donegal Gaeltacht attracts thousands of attendees on an annual basis.\nA native Irish speaker, Pearse is a keen promoter of the Irish language and the development of Gaeltacht regions. "
  },
  {
    "name": "Noel Jordan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/noel-jordan/",
    "statement": "I am proud and privileged to represent the community of the Donegal. I am a native of the parish of Inver, residing in Mountcharles with my wife and our two children.\nThis is a wonderful place to live and raise children. Not alone are we blessed with outstanding beauty but also a strong and resilient sense of community.\nI have been on Donegal County Council for ten years now, and have held a number of important roles: Leas Cathaoirleach twice, Municipal District Chairperson twice and I have enjoyed working with the local community, sporting, church, farming and fishing groups and committees in sourcing funding and infrastructure in these sectors over the years."
  },
  {
    "name": "Denise Mitchell",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/denise-mitchell/",
    "statement": "Denise was born and reared in Dublin’s northside.\nShe lives in Ayrfield where she is raising her family. A hard worker who has represented her community with pride as a City Councillor and TD since 2014.\nDenise has been a community activist her entire adult life; campaigning on important issues such as housing and other key public services, giving voice to those in her community who have been left behind."
  },
  {
    "name": "Mícheál Mac Donncha",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/micheal-mac-donncha/",
    "statement": "Mícheál Mac Donncha has been a Councillor since 2011. In 2017/2018 he was Ardmhéara/Lord Mayor of Dublin. From 1997 to 2014 he worked in the Dáil with the Sinn Féin team. He has lived in Dublin Bay North all his life, in Howth and then for over 50 years in Kilbarrack. Gníomhaí ar son na Gaeilge is ea Mícheál agus bíonn sé go minic ag labhairt ar na meáin Ghaeilge."
  },
  {
    "name": "Chris Andrews",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/chris-andrews/",
    "statement": "Chris is the Sinn Féin TD for Dublin Bay South. Prior to being elected, Chris worked with Dublin’s homeless and as a City Councillor. Chris is a housing and community activist, and a long-time Shamrock Rovers fan.\nAs the Sinn Féin spokesperson on Sport, Chris has developed sport policies (Sport Facilities Strategy, the Activity Card) that would better support local sports and community clubs, and provide better access to activities for children and families. Chris has been a strong advocate for the regeneration of Dublin city and is committed to making the city a vibrant and healthy environment."
  },
  {
    "name": "Mary Lou McDonald",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/mary-lou-mcdonald/",
    "statement": "Mary Lou McDonald has been a TD for Dublin Central since 2011 and is Uachtarán Shinn Féin. As leader of the opposition since 2020, Mary Lou has stood up for workers and families who need a break.\nMary Lou works daily for Dublin Central communities and is committed to delivering real change, including the regeneration of the flats, better community safety, and the delivery of social and affordable housing."
  },
  {
    "name": "Janice Boylan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/janice-boylan/",
    "statement": "Janice Boylan has been a local councillor for Sinn Féin since 2014 and is a voice for her community. She is from O’Devaney Gardens in the North West Inner City and is a mother and grandmother.\nJanice is from a working-class family and is committed to delivering real change for communities, including the regeneration of the flats, better community safety, and the delivery of social and affordable housing."
  },
  {
    "name": "Ann Graves",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/ann-graves/",
    "statement": "Since 2019 I have represented the residents of Swords as an elected Councillor. This is a privilege and while very rewarding is also challenging as we deal with a spiraling cost-of-living crisis and the impacts on households, access to housing and healthcare where costs have risen and services are more difficult to access, growing crime and issues around infrastructure.\nI’ve lived in Swords for 33 years, I have three adult children and a grandchild. I’m involved in many community groups and am aware of the challenges facing residents and work to address these.\nAs we face into the general election I hope to represent our communities to make Fingal East a better place for all. I work closely with Louise O’Reilly TD and across Dublin Fingal we want to deliver real change as part of a Sinn Féin led government\n"
  },
  {
    "name": "Louise O'Reilly",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/louise-oreilly/",
    "statement": "Louise O’Reilly has been TD for Fingal since 2016 and before that was a trade union organiser representing workers in the Public and Private sectors. A mother and a grandmother, Louise lives in Fingal West with her husband. She supports the Dubs and can often be seen cycling to clinics and events around the North County. She is currently the Sinn Féin Enterprise and Workers Rights spokesperson and in that role has worked with many of the businesses and community groups across Fingal."
  },
  {
    "name": "Eoin Ó Broin",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/eoin-o-broin/",
    "statement": "Eoin Ó Broin has been a TD for Dublin Mid-West since 2016 and was reflected in 2020. He was formerly a Councillor for the Clondalkin LEA on South Dublin County Council from 2014. Eoin is the party’s spokesperson on Housing and Planning.\nIn the Dáil he has spearheaded the campaign for affordable homes, proper planning and tackling the legacy of Celtic Tiger era defects. He is author of five books on politics, housing, building defects and architecture.\nHe has worked for Sinn Féin since 1995 in Belfast, Brussels and Dublin and also worked for one of the countries leading homeless charities from 2008 to 2011."
  },
  {
    "name": "Mark Ward",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/mark-ward/",
    "statement": "Mark is a father of three children who is from Clondalkin and living in Lucan\nMark is a behavioural therapist who has worked in frontline addiction and mental health services.\nMark became a Sinn Fein public representative in 2016. He was elected Mayor of South Dublin in 2018. He topped the poll in 2019 local elections. In November 2019, Mark successfully contested a by-election in Dublin Mid- West, topping the poll and becoming the second TD for Sinn Féin in the area. Mark was re-elected in the 2020 General Election.\nAs Sinn Féin Spokesperson for Mental Health and Community Safety, Mark has advocated for people to be able to access services in a timely manner. He has been particularly vocal on long waiting lists for CAMHS, children’s disability services and special education places. Local issues of housing and community services have always been a priority for Mark."
  },
  {
    "name": "Dessie Ellis",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/dessie-ellis/",
    "statement": "Born and raised in Finglas, Dessie has been involved in Republican politics for over 50 years.\nHe was a Dublin City Councillor for almost 12 years before being elected a TD for Dublin North West in 2011. He retained his seat in the 2020 General Election, topping the poll.\nDessie has spent his entire political career standing up for the people of Dublin North West."
  },
  {
    "name": "Cathleen Carney Boud",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/cathleen-carney-boud/",
    "statement": "Elected to Dublin City Council in 2014 for Ballymun, and Deputy Lord Mayor in 2018/19, Cathleen also stood in the general election 2016 alongside Dessie Ellis. A graduate of Trinity College with a Degree in Law and Politics she works as a political advisor in the Seanad. Married with three adult children Cathleen knows the impact of the housing crisis on young people. She is also fighting for better mental health services."
  },
  {
    "name": "Shaun Tracey",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/shaun-tracey/",
    "statement": "Shaun has lived his whole life in Ballyogan and the surrounding areas.\nHe has worked full time for Sinn Féin since 2004, spending sixteen years working in the Press Office in the Dáil. Since 2020 he has been working as a National Administrator in Sinn Féin Ard Oifig.\nHe is strongly committed to his local community and has been involved in many local issues including local housing campaigns, the campaign to stop the closure of Stepaside Garda Station and the Right2Water Campaign."
  },
  {
    "name": "Aengus Ó Snodaigh",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/aengus-o-snodaigh/",
    "statement": "A TD for 22 years, Aengus Ó Snodaigh is currently Sinn Féin’s spokesperson on Gaeilge, Arts, Tourism, Heritage and the Media. He is chair of the Oireachtas Coiste Gaeilge, Gaeltacht agus Phobal Labhartha na Gaeilge, while also being a long-term member of the Dáil Reform Committee, Committee on Parliamentary Privileges and Oversight, and the British-Irish Parliamentary Assembly.\nA native Irish speaker Aengus was raised in Dublin, joined Sinn Fein in UCD and worked in An Phoblacht before being employed in Foras na Gaeilge. A married man, with three grown up children, Aengus lives now in Crumlin with his wife Aisling.\nCurrently chair of the drug rehabilitation and textile recycling charity, Liberty, Aengus is also a board member of Bluebell CDP, Bluebell Community Council, Dolphin House Regeneration Board and Canal Communities Local Drug & Alcohol Task Force\nA campaigner for better housing, for workers, community and language rights, Aengus was on the Moore Street Advisory Group, and involved in many local history and heritage groups including campaigns to save Kilmainham Mill, Richmond Barracks, the Pearse Family home and Croppies Acre."
  },
  {
    "name": "Máire Devine",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/maire-devine/",
    "statement": "A proud Liberties girl living in Kilmainham, a senior psychiatric nurse, I’ve been a Councillor or Senator since 2011.\nI’m campaigning for a Well-being Quarter for Dublin 8. A member of two local Drug & Alcohol Taskforces, St James’ Hospital Board, and the Children’s Hospital Residents Forum.\nAn active member of four regeneration boards (Emmet Road, Oliver Bond, Donore Ave, and Dolphin House), I’m also on DCC’s Planning Committee where I influence the built environment of our City , guide local communities with the Planning process and hold developers to account.\nWith history so central locally, I’m on Board of Kilmainham Gaol, a campaigner for restoration of the Iveagh Market, Kilmainham Mill, & Inchicore Library.\nWith your support I will continue to serve you, yours and ours on a national level and prioritise;\nAffordable & social homes\nIncreased heritage protections\nSafer communities with more Gardaí\nDelivery of essential Sport facilities."
  },
  {
    "name": "Daithí Doolan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/daithi-doolan/",
    "statement": "Daithí Doolan is a Dublin City Councillor with 15 years experience. He has a strong track record of representing communities, standing up for ordinary people and working for Irish Unity. He has been a leading campaigner on supporting Dublin Fire Brigade, affordable housing, defending public services and justice for Palestine."
  },
  {
    "name": "Niamh Whelan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/niamh-whelan/",
    "statement": "Niamh Whelan is a dedicated and active member of the Tallaght community, where she lives with her husband and young family. Niamh is currently elected to South Dublin County Council, supporting constituents and empowering local community groups through this role. Representing a generation that has faced enormous housing challenges, Niamh is resolute in her commitment to address the pressing issue of social and affordable housing, prioritising this issue if elected\nPassionate about inclusion, equal access to heathcare, childcare and supports for children and adults with additional needs, these issues will be priority for Niamh if elected.\nNiamh and her family proudly participate in many local organisations, community is at the heart of her representation. She is a catalyst for positive change, ready to champion her community’s needs and ambitions if elected for Dublin South West."
  },
  {
    "name": "Seán Crowe",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/sean-crowe/",
    "statement": "A lifelong Dublin republican and community activist, Seán Crowe is originally from Rathfarnham and has lived in Tallaght with his wife Pamela since 1988. Seán represented Sinn Féin in the multi-party negotiations that led to the Good Friday Agreement and has travelled internationally to promote the party’s peace and reconciliation strategy.\nSeán has been outspoken on the current housing shortages, the cost of living crisis and has been particularly vocal in his support for our healthcare workers."
  },
  {
    "name": "Paul Donnelly",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/paul-donnelly/",
    "statement": "Paul Donnelly has served as a TD for Dublin West for five years, tirelessly advocating for the community’s needs.\nA committed public representative, Paul has championed several crucial issues including housing, health, educational disadvantage, and services for autistic children.\nHe has also been a steadfast supporter of Dublin Fire Brigade and has campaigned for improved mental health services. Recognised for his dedication, Paul was appointed Sinn Féin’s Community Development spokesperson."
  },
  {
    "name": "Breda Hanaphy",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/breda-hanaphy/",
    "statement": "Breda Hanaphy has proudly represented the people of Blanchardstown-Mulhuddart electoral area on Fingal County Council for over five years. She has called Corduff her home for over forty years, where she and her husband Paddy have raised four children and now cherish being grandparents and great-grandparents. Her journey with Sinn Féin has been long and fulfilling, deeply rooted in serving her community. She is seeking your support to serve the residents of Dublin West, as a Sinn Féin TD with Paul Donnelly."
  },
  {
    "name": "Shane O'Brien",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/shane-obrien/",
    "statement": "Shane was born & reared in Dún Laoghaire and currently lives with his fiancé Katie in Rory O’Connor Park.\nA hard worker with a wealth of real-life experience working across many sectors including finance, manufacturing & construction.\nHe has worked in many roles within Sinn Féin including county councillor, policy manager and is currently a senior manager for the party in Leinster House, working closely with party president Mary Lou McDonald & Pearse Doherty TD."
  },
  {
    "name": "Louis O'Hara",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/louis-ohara/",
    "statement": "As someone who has lived all my life in Athenry, I am acutely aware of the issues facing communities across East Galway.\nA full-time public representative on Galway County Council, I am proud to represent our county and work tirelessly to deliver better services and outcomes for all in our community.\nAs a young person I understand the pressing issues facing my generation and the urgency of developing a future where young people can thrive, and not be forced to emigrate."
  },
  {
    "name": "Mairéad Farrell",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/mairead-farrell/",
    "statement": "Mairéad Farrell is the Sinn Féin TD for Galway West since 2020. She is a proud Galwegian who previously served on Galway City Council. She is currently chair of the Public Accounts Committee and spokesperson for Further and Higher Education."
  },
  {
    "name": "Pa Daly",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/pa-daly/",
    "statement": "Pa Daly is the Sinn Féin spokesperson on Justice and has been a TD for Kerry since 2020. He is a member of the Justice Committee and has also sat on Comhcoiste na Gaeilge and the Assisted Dying Committee.\nA qualified solicitor, he practiced in Dublin and Kerry since 1996. Pa is married to Mary Ross from Causeway and they have four children.\nPa has been involved in local organisations such as Tralee parkrun, Tralee Dynamos, Anamfest Trá Lí, the board of Fleadh Cheoil na Mumhan and is a member of Na Gaeil."
  },
  {
    "name": "Stephanie O'Shea",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/stephanie-oshea/",
    "statement": "I’m a proud mother of two from Cahersiveen, passionate about South Kerry and deeply involved in community projects.\n\nAffordable housing and accessible mental health services are vital for our future.\n\nAs part of “generation rent,” I understand families' challenges and I am committed to improving community facilities, infrastructure, and amenities.\n\nAs your representative, I'll work tirelessly to bring solutions to South Kerry, reviving our community. Let's build a future where everyone's needs are met, ensuring a brighter tomorrow for our families and generations to come."
  },
  {
    "name": "Réada Cronin",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/reada-cronin/",
    "statement": "Réada Cronin is your Kildare North TD since 2020. Before that Réada was a Councillor on Kildare County Council from 2014. She serves as the Sinn Féin Spokesperson on Defence. Prior to her election to the Dáil, she worked in the Disability sector, gaining insights into the challenges of disabled people, family carers and Section 38/39 organisations. Her commitment to social justice, a just transition and animal welfare remains central to her politics."
  },
  {
    "name": "Caroline Hogan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/caroline-hogan/",
    "statement": "Caroline Hogan has worked as Constituency Manager for Kildare North TD, Réada Cronin, for almost five years. Caroline can hit the ground running in Housing, Health, Childcare, Education, Transport. An outstanding organiser and listener, she knows how to navigate government departments to get the best results, in the quickest time possible, for constituents.\nYour vote matters and we are delighted to run two candidates in Kildare North. You can trust Sinn Féin to stand with you, by you."
  },
  {
    "name": "Shónagh Ní Raghallaigh",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/shonagh-ni-raghallaigh/",
    "statement": "Shónagh is a hardworking local councillor in Kildare. She is also a dedicated múinteoir at Gaelscoil Mhic Aodha and a proud advocate of our native language. A mother of four, Shónagh finds her greatest purpose in community service. She has consistently advocated for a fairer society where everyone can thrive, and is committed to addressing local challenges, from securing affordable housing and better childcare, to tackling the rising cost of living."
  },
  {
    "name": "Maria McCormack",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/maria-mccormack/",
    "statement": "Maria (O’Connor) McCormack is a dedicated community advocate and our Sinn Féin candidate for the upcoming General Election in Laois. A qualified pharmacy technician with years of experience in healthcare, she is passionate about improving mental health services and creating better facilities for youth. Having a daughter with ASD, Maria deeply understands the challenges families face and is committed to fostering a supportive and inclusive environment for all Laois residents."
  },
  {
    "name": "Maurice Quinlivan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/maurice-quinlivan/",
    "statement": "Limerick City TD and Chairperson of Joint Oireachtas Committee on Enterprise, Trade and Employment.\nA native of Ballynanty Beg, Maurice Quinlivan comes from a well-known Limerick family.\nEducated at Hassett’s Cross CBS, St. Nessan’s Community College and the School of Professional and Management Studies (now TUS), graduating with a qualification in Industrial Engineering and Training, Maurice worked in the travel agency business for many years as a Manager in London and of Budget Travel in the Crescent Shopping Centre.\nMaurice was first elected to Limerick City Council in 2009 and was re-elected in May 2014, topping the poll.\nElected to the Dáil in February 2016, he became the first Sinn Féin TD for Limerick City in 93 years. He retained his seat in the 2020 General Election, topping the poll.\nHe is the Chairperson of the influential Oireachtas Committee on Enterprise, Trade and Employment. His work in Leinster House has primarily focused on advocating for increased investment for Limerick for University Hospital Limerick, tackling drugs, more supports for addiction services, dealing with crime antisocial behaviour, for more social and affordable housing in Limerick."
  },
  {
    "name": "Paul Gavan",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/paul-gavan/",
    "statement": "Paul has served in the Seanad since 2016, and as a former Trade Union Official has been a champion of workers’ rights throughout his life. Paul lives in Castleconnel with his wife, Ursula, and his three children. \nHis work in Leinster House has primarily focused on a radical increase in housing investment for Limerick. He has also demanded action on University Hospital Limerick, public transport and the introduction of a true living wage.  "
  },
  {
    "name": "Joanne Collins",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/joanne-collins/",
    "statement": "Joanne Collins has worked in Sales, Marketing and Financial Compliance, and is a qualified SNA. She volunteers in her local community and currently holds the position of chairperson of Cappagh Community Creche.\nJoanne is passionate about protecting rural Ireland. She lives in Cappagh, Askeaton while building her family home in Carrigkerry with her husband Trevor and four children. Not from a political background, Joanne sought out politics as a means to fix the problems she could see around her, and chose the party seeking the radical changes she was working for.\nJoanne has been active on local and national issues such as; better working conditions for firefighters, fighting to keep banking services in our rural towns, campaigning to reinstate the no fault eviction ban, seeking action on crises in UHL and keeping the ongoing cost of living crisis on the political agenda.\nAs a mother of four Joanne has experienced first hand some of the hardships facing families and is very eager to find ways to alleviate the pressures families are enduring."
  },
  {
    "name": "Sorca Clarke",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/sorca-clarke/",
    "statement": "Sorca Clarke has been a TD for Longford Westmeath since 2020, previously serving as a Councillor. As Sinn Féin’s spokesperson on Education she has highlighted how proper funding for schools, effective school transport, tackling teacher and staff shortages can be achieved.\nSorca, between her 3 constituency offices and rural clinics, she works every day on issues affecting her constituents including housing, childcare, transport, public services and investment in rural communities."
  },
  {
    "name": "Barry Campion",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/barry-campion/",
    "statement": "Barry lives in Moyne in rural North Longford with his husband and dogs. He previously lived in Granard for over ten years.\nHe is a founding member of the Irish Red Cross Unit in Longford and in recent times has been involved with the launch of Longford Pride.\nBarry is passionate about mental health and is a founding member of a mens swimming and mental health awareness group based in Mullingar.\nIf elected Barry will work hard on your behalf to deliver a fairer, stronger and more equal Ireland and ensure public resources are used to benefit all our people."
  },
  {
    "name": "Ruairí Ó Murchú",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/ruairi-o-murchu/",
    "statement": "Ruairí has been a TD since February 2020, retaining the seat for Sinn Féin that was held by Gerry Adams and Arthur Morgan. Ruairí was previously a Louth County councillor from 2017.\nHe is a member of the Oireachtas group on Autism. Since he was elected to Leinster House, Ruairí has been passionate about disabilities, mental health services and services for children with autism, advocating at every opportunity for families.\nRuairí has also been a strong voice in Leinster House for older people. And he has focused on communities impacted by crime and anti social behaviour.\nMarried to Annemarie, he has two sons and a stepson, and lives in Bay Estate in Dundalk. He has a masters in Computer Science."
  },
  {
    "name": "Joanna Byrne",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/joanna-byrne/",
    "statement": "Born and raised in Drogheda, Joanna has been a member of Louth County Council since 2016, retaining her seat in 2019 and again in 2024.\nShe is heavily involved in sport as chairperson of Drogheda United FC and was recently elected onto the FAI’s National League Committee, becoming a strong voice for Drogheda on a national stage.\nCity status for Drogheda and proper local government, accountable to the people, are at the top of her agenda.\nAs a councillor, Joanna has been relentless on the issues of housing as well as advocating for better facilities for those in addiction. She is a hardworking woman highlighting issues like dumping, road safety, housing maintenance, transfers, vacancy rates and celebrating the LGBTQ+ community."
  },
  {
    "name": "Antóin Watters",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/antoin-watters/",
    "statement": "Antóin Watters has been a County Councillor since 2016 and lives in Cooley with his wife and two young children. Since being elected Antóin has been to the forefront on many issues including water services, flooding relief and defences, road safety, fly-tipping, anti- social behaviour and more.\nAntóin feels rural Ireland has been neglected and under-resourced for too long. He believes in ‘working nationally and delivering locally’."
  },
  {
    "name": "Rose Conway Walsh",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/rose-conway-walsh/",
    "statement": "Rose Conway-Walsh TD, Sinn Féin Spokesperson for Public Expenditure and Reform, was elected to Dáil Éireann in 2020 after leading the Sinn Féin team in the Seanad (2016-2020) and serving on Mayo County Council (2009-2016).\nRose brings the key issues impacting Mayo to the Dáil floor and to the Oireachtas Committees she serves on: Finance & Public Expenditure, Budgetary Oversight, Good Friday Agreement Implementation and Education Committee when she was Party Spokesperson for Further and Higher Education (2020-2023).\nRose is driven by a determination to make Mayo a better place and to fulfil the true potential of rural Ireland.\nRose’s political experience is underpinned by her relevant academic achievements: BA in Public Management, a MA in Local Government and a MSc in Economic Policy from Trinity.\nRose has two constituency offices in Ballina and Belmullet."
  },
  {
    "name": "Gerry Murray",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/gerry-murray/",
    "statement": "Since first elected to Mayo County Council, Cllr Gerry Murray has championed social and economic projects for his community, including libraries, arts centres, playgrounds, sports facilities, and local road maintenance.\nHe led campaigns for local authorities’ stake in Ireland West Airport and advocates for balanced regional development.\nFocused on improving infrastructure such as roads, rail, and broadband, he believes these investments are crucial for rural Ireland to attract foreign investment and support indigenous industry."
  },
  {
    "name": "Darren O'Rourke",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/darren-orourke/",
    "statement": "Darren O’Rourke is TD for Meath East since 2020. He previously served as a County Councillor on Meath County Council from 2014 to 2020. He is Sinn Féin’s spokesperson on Climate Action and the Environment and is a member of the Oireachtas Committees on Climate, Environment, Transport and Communications.\nSince being elected to the Dáil, Darren has worked tirelessly for the people of Meath and fights for investment in housing, jobs, public services and community infrastructure in the county.\nPreviously, Darren worked as a Medical Scientist in the Irish health service and as a Policy Advisor in the Dáil and European Parliament. He holds masters degrees from Trinity College Dublin and the Royal College of Surgeons in Ireland.\nDarren is married to Maria. They have 3 young children."
  },
  {
    "name": "Maria White",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/maria-white/",
    "statement": "Originally from Dublin, Maria was elected to Meath County Council in June 2024. With extensive leadership experience as a school principal of ten years, she currently serves on multiple Boards including LMETB and DIFE.\nHaving previously worked with Focus Ireland, Maria has a deep understanding of homelessness. Her recent activism has primarily focused on increasing Garda resources and community policing, transport and road safety issues. She works tirelessly advocating for constituents."
  },
  {
    "name": "Johnny Guirke",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/johnny-guirke/",
    "statement": "Johnny Guirke has proudly served the people of Meath for more than 10 years; having been first elected to Meath County Council in 2014, and then the Dáil in 2020. As your local TD, Johnny has been to the fore on issues including the delivery of Navan Rail, falling Garda numbers, increasing cost of housing & childcare, lack of access to GP appointments, and the downgrading of services at Navan Hospital."
  },
  {
    "name": "Aoife Masterson",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/aoife-masterson/",
    "statement": "Aoife currently serves as a Councillor on Offaly County Council where she works hard every day to ensure your voice is heard and your needs represented.\nA lifelong activist, and former lecturer in law, she has a proven track record of delivering results and effecting change, having previously worked for the Free Legal Advice Centres (FLAC) and the Irish Council for Civil Liberties (ICCL).\nAoife knows first-hand the real difficulties people in Offaly face with a lack of affordable housing, sparse healthcare services, and underinvestment of our rural communities.\nShe is passionate about delivering on the things that matter to our community and has the policies, ambition, and commitment to bring about real change for workers, families, and businesses across Offaly."
  },
  {
    "name": "Claire Kerrane",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/claire-kerrane/",
    "statement": "I am very proud to have represented the people of Roscommon/Galway since 2020. It has been the greatest honour of my life and I have given the role everything. In 2020 I made a promise to the people, if elected, I would work hard and always be honest. I have done that, and I now make that promise to you again."
  },
  {
    "name": "Martin Kenny",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/martin-kenny/",
    "statement": "Martin Kenny is from Aughavas in Co. Leitrim, where he and his wife Helen raised their four children. Martin has represented Sligo, Leitrim, and South Donegal since 2016.\nHe has held various portfolios, including Justice and Transport & Communications, and is currently the Spokesperson on Agriculture & Rural Development.\nHis priorities are the redevelopment of the northwest, the rollout of sustainable travel and more and better essential services across rural areas."
  },
  {
    "name": "Chris MacManus",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/chris-macmanus/",
    "statement": "Chris MacManus is well known for his community and political activism, having proudly represented his wider Sligo community as a councillor since 1999, and the greater Northwest as an MEP in Brussels, highlightingdecades of regional imbalance and rural decline.\nHe has championed the Northwest as a member of many national and local organisations and campaigns, including Palestinian Solidarity, Right2Water, and Yes Equality.\nChris lives in Maugheraboy, Sligo."
  },
  {
    "name": "Dan Harty",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/dan-harty/",
    "statement": "Dan is from Thurles and has a partner and three children. Dan works in veterinary supply, retail and on the family farm. He has a degree in Archaeology and Celtic Civilisation with a postgraduate in Business and Supply Chain Management. Passionate about sport, Dan has competed in GAA, soccer and athletics with various clubs. Through decades of community activism, he is acutely aware of the challenges facing all our communities, both urban and rural."
  },
  {
    "name": "Evan Barry",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/evan-barry/",
    "statement": "As the son to an Irish mother and French father, my upbringing instilled in me a strong interest in history and politics. Studying in UCC I have a Master’s in political science, and currently work for Sinn Féin as a policy advisor and constituent advocate in Leinster House. I am acutely aware of how failed government policies and runaway government departments are impacting the lives our communities. I will work tirelessly and passionately to restore community welfare and improve the lives of everyone in Tipperary North."
  },
  {
    "name": "Martin Browne",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/martin-browne/",
    "statement": "From Knockavilla and living in Cashel. I’ve been involved in community groups and initiatives for over 30 years, with a degree in Community Development.\nElected to Cashel Town Council in 2011, to Tipperary County Council in 2014, and as Sinn Féin TD in 2020, I chair the Joint Committee on Public Petitions.\nI advocate for young families, farming communities and pensioners.\nPriorities are housing availability, rural transport, and in defence of the family farm. I will be a strong voice for Tipperary."
  },
  {
    "name": "David Cullinane",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/david-cullinane/",
    "statement": "David Cullinane is the Sinn Féin TD for Waterford, first elected in 2016. He was a Senator from 2011-2016.\nDavid is the father of Emmet and Finn. He is a long-term campaigner on health and public services in the South-East, particularly on cancer, cardiac, and palliative care services.\nHe has been an advocate for 24/7 emergency cardiac services at University Hospital Waterford, developing Waterford Airport, regenerating Waterford North Quays, establishing a University for the South East, investing in Waterford Port, and developing offshore energy."
  },
  {
    "name": "Conor D McGuinness",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/conor-d-mcguinness/",
    "statement": "Cllr Conor D McGuinness is the Sinn Féin group leader on Waterford City and County Council. He lives in the West Waterford Gaeltacht, where he and his wife are raising a young family.\nConor is a vocal advocate for County Waterford. He is determined that towns, villages and rural communities across the County get their fair share of investment and public services.\nAs an active trade unionist he is a proud advocate for workers rights and equality."
  },
  {
    "name": "Johnny Mythen",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/johnny-mythen/",
    "statement": "Johnny lives in Enniscorthy with his wife Barbara.\nFirst elected to the Dáil in 2020 with a record 18,717 first preference votes, Johnny has worked diligently on behalf of the people of Wexford.\nJohnny previously served as a member of Wexford County Council, and proudly served as the last Cathaoirleach of Enniscorthy Town Council.\nA former ESB worker, he was active in the Unite Union.\nAn active follower of the GAA, Johnny has coached both codes of GAA, and also coached senior and under-age rugby teams."
  },
  {
    "name": "John Brady",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/john-brady/",
    "statement": "John Brady has been a TD for Wicklow since 2016 and previously served on Wicklow County Council.\nMarried to Gayle, the father of five, and recently a grandfather, from an early age John understood that the establishment had no real interest in representing the interests of his community which led to his involvement in community activism.\nJohn has a hard-earned reputation for fighting for the rights and needs of the people of Wicklow."
  },
  {
    "name": "Fionntain Ó Súilleabháin",
    "party": "Sinn Féin",
    "candidatePage": "https://vote.sinnfein.ie/dail_election/fionntain-o-suilleabhain/",
    "statement": "Fionntán Ó Súilleabháin lives along the Wicklow/Wexford border and is a Gaelscoil teacher who is passionate about promoting Gaeilge and local history.\nA married father of one, Fionntán has been a tireless advocate for affordable and sustainable housing provision.\nFirst elected Councillor in 2014, Fionntán has built a reputation as a straight-talking and passionate campaigner, determined to improve local services and infrastructure provision across Wicklow/Wexford."
  }
]